<template>
  <div>
    <div class="bar"></div>
    <SlideShow>
      <template #title>
        <div class="title">活動消息</div>
      </template>
    </SlideShow>
    <div class="bar bar2"></div>
    <div class="section">
      <div class="first-box">
        <img
          src="https://images.unsplash.com/photo-1694271643834-4aaaef614add?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1925&q=80"
          alt=""
        />
      </div>
      <div>
        當我們談論度假或商務旅行時，選擇一家舒適、方便的旅館是一個至關重要的決策。旅館不僅提供了一個舒適的住宿環境，還能為我們的旅程增添愉快的體驗。本文將探討旅館的重要性以及如何選擇最適合您需求的旅館。
        旅館是旅行者的家外之家。當我們離開家鄉，到達一個陌生的城市時，我們渴望一個安全、舒適的地方休息和放鬆。旅館提供了這樣的空間。無論您是前往度假勝地還是商務會議，一家優質的旅館都能滿足您的需求。
        首先，選擇一家適合您需求的旅館非常重要。如果您正在計劃一個浪漫的度假，您可能會選擇一家豪華度假村，享受精緻的服務和設施，如水療中心、高級餐廳和私人泳池。然而，如果您是商務旅行者，您可能更關心旅館的位置，以便輕鬆前往會議場地或客戶的辦公室。
        除了位置和設施，價格也是選擇旅館的重要考慮因素之一。旅館的價格範圍廣泛，從經濟型到高端豪華型都有。您應根據您的預算和需求來選擇適合的選擇。一些旅館提供特別的促銷和折扣，可以節省您的費用，因此在預訂前要仔細查看這些優惠。
        對於許多旅客來說，旅館的評價和口碑也是重要的參考依據。您可以通過在網上閱讀其他旅客的評論來了解旅館的實際情況。這些評論通常包含有關服務、清潔度、設施和工作人員態度的信息，這些信息可以幫助您做出明智的選擇。
        除了以上提到的因素，還有一些其他因素也值得考慮。例如，旅館的取消政策、免費停車場、免費早餐和Wi-Fi等附加服務也可能影響您的決策。要確保您在旅途中的住宿愉快，您應該在預訂前詳細了解這些細節。
        總之，旅館在旅行中扮演著極為重要的角色。選擇一家合適的旅館可以讓您的旅程更加愉快和無憂。無論您是度假還是商務旅行，請花時間研究並選擇一家滿足您需求的旅館，這將有助於您在外地感到舒適和安心。希望這些建議能幫助您在下一次旅行中做出明智的選擇，享受一段難忘的時光。
      </div>
    </div>
    <div class="section">
      <div class="first-box">
        <img
          src="https://images.unsplash.com/photo-1694271643834-4aaaef614add?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1925&q=80"
          alt=""
        />
      </div>
      <div>
        當我們談論度假或商務旅行時，選擇一家舒適、方便的旅館是一個至關重要的決策。旅館不僅提供了一個舒適的住宿環境，還能為我們的旅程增添愉快的體驗。本文將探討旅館的重要性以及如何選擇最適合您需求的旅館。
        旅館是旅行者的家外之家。當我們離開家鄉，到達一個陌生的城市時，我們渴望一個安全、舒適的地方休息和放鬆。旅館提供了這樣的空間。無論您是前往度假勝地還是商務會議，一家優質的旅館都能滿足您的需求。
        首先，選擇一家適合您需求的旅館非常重要。如果您正在計劃一個浪漫的度假，您可能會選擇一家豪華度假村，享受精緻的服務和設施，如水療中心、高級餐廳和私人泳池。然而，如果您是商務旅行者，您可能更關心旅館的位置，以便輕鬆前往會議場地或客戶的辦公室。
        除了位置和設施，價格也是選擇旅館的重要考慮因素之一。旅館的價格範圍廣泛，從經濟型到高端豪華型都有。您應根據您的預算和需求來選擇適合的選擇。一些旅館提供特別的促銷和折扣，可以節省您的費用，因此在預訂前要仔細查看這些優惠。
        對於許多旅客來說，旅館的評價和口碑也是重要的參考依據。您可以通過在網上閱讀其他旅客的評論來了解旅館的實際情況。這些評論通常包含有關服務、清潔度、設施和工作人員態度的信息，這些信息可以幫助您做出明智的選擇。
        除了以上提到的因素，還有一些其他因素也值得考慮。例如，旅館的取消政策、免費停車場、免費早餐和Wi-Fi等附加服務也可能影響您的決策。要確保您在旅途中的住宿愉快，您應該在預訂前詳細了解這些細節。
        總之，旅館在旅行中扮演著極為重要的角色。選擇一家合適的旅館可以讓您的旅程更加愉快和無憂。無論您是度假還是商務旅行，請花時間研究並選擇一家滿足您需求的旅館，這將有助於您在外地感到舒適和安心。希望這些建議能幫助您在下一次旅行中做出明智的選擇，享受一段難忘的時光。
      </div>
    </div>
    <div class="section">
      <div class="first-box">
        <img
          src="https://images.unsplash.com/photo-1694271643834-4aaaef614add?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1925&q=80"
          alt=""
        />
      </div>
      <div>
        當我們談論度假或商務旅行時，選擇一家舒適、方便的旅館是一個至關重要的決策。旅館不僅提供了一個舒適的住宿環境，還能為我們的旅程增添愉快的體驗。本文將探討旅館的重要性以及如何選擇最適合您需求的旅館。
        旅館是旅行者的家外之家。當我們離開家鄉，到達一個陌生的城市時，我們渴望一個安全、舒適的地方休息和放鬆。旅館提供了這樣的空間。無論您是前往度假勝地還是商務會議，一家優質的旅館都能滿足您的需求。
        首先，選擇一家適合您需求的旅館非常重要。如果您正在計劃一個浪漫的度假，您可能會選擇一家豪華度假村，享受精緻的服務和設施，如水療中心、高級餐廳和私人泳池。然而，如果您是商務旅行者，您可能更關心旅館的位置，以便輕鬆前往會議場地或客戶的辦公室。
        除了位置和設施，價格也是選擇旅館的重要考慮因素之一。旅館的價格範圍廣泛，從經濟型到高端豪華型都有。您應根據您的預算和需求來選擇適合的選擇。一些旅館提供特別的促銷和折扣，可以節省您的費用，因此在預訂前要仔細查看這些優惠。
        對於許多旅客來說，旅館的評價和口碑也是重要的參考依據。您可以通過在網上閱讀其他旅客的評論來了解旅館的實際情況。這些評論通常包含有關服務、清潔度、設施和工作人員態度的信息，這些信息可以幫助您做出明智的選擇。
        除了以上提到的因素，還有一些其他因素也值得考慮。例如，旅館的取消政策、免費停車場、免費早餐和Wi-Fi等附加服務也可能影響您的決策。要確保您在旅途中的住宿愉快，您應該在預訂前詳細了解這些細節。
        總之，旅館在旅行中扮演著極為重要的角色。選擇一家合適的旅館可以讓您的旅程更加愉快和無憂。無論您是度假還是商務旅行，請花時間研究並選擇一家滿足您需求的旅館，這將有助於您在外地感到舒適和安心。希望這些建議能幫助您在下一次旅行中做出明智的選擇，享受一段難忘的時光。
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
import SlideShow from '../components/SlideShow.vue';

</script>

<style lang="scss" scoped>
div {
  margin: 0 auto;
}
.section {
  padding: 20px 40px;
  display: flex;
}
.title {
  font-size: 24px;
}
.bar {
  height: 8px;
  width: 100%;
  background: #816d4f;
}
.bar2 {
  max-width: 50px;
  margin-top: 20px;
}
img {
  height: 300px;
  overflow: hidden;
  border-radius: 30px;
  @include box-shadow;
}
.first-box {
  margin-right: 50px;
}
:deep .grecaptcha-badge {
  display: none !important;
}
</style>
